IDEA Open Model
CutData Class
 Provides data of the cut beam
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.CutData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public class CutData
Public Class CutData
public ref class CutData
The CutData type exposes the following members.
Constructors
Name | Description
CutData
Initializes a new instance of the CutData class
Top
Properties
Name | Description
PlaneNormalX
 3DPlane Normal AxisX
PlaneNormalY
 3DPlane Normal AxisY
PlanePoint
 3DPlane Point
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace